import { FC } from 'react'
import { Link, useLocation } from 'react-router-dom'

const Navbar: FC = () => {
    const location = useLocation()

    const isActive = (path: string) => {
        return location.pathname === path
    }

    const navLinks = [
        {
            path: '/plans',
            label: '官方套餐',
            icon: (
                <div className={isActive('/plans') ? 'filter drop-shadow-[0_0_3px_rgba(39,174,96,0.6)]' : ''}>
                    <svg className="mr-2" width="14.053345" height="18.472229" viewBox="0 0 14.0533 18.4722" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <desc>
                            Created with Pixso.
                        </desc>
                        <defs />
                        <g opacity={isActive('/plans') ? "1" : "0.6"}>
                            <path id="Fill 1170" d="M4.18 18.47C3.88 18.47 3.58 18.41 3.31 18.3C3.03 18.19 2.8 18.03 2.61 17.83C2.43 17.65 2.31 17.43 2.26 17.19C2.2 16.96 2.21 16.72 2.29 16.49L3.95 11.28L1.2 10.38C0.92 10.28 0.66 10.14 0.46 9.94C0.26 9.75 0.12 9.52 0.05 9.28C-0.02 9.03 -0.02 8.78 0.05 8.53C0.13 8.29 0.28 8.06 0.48 7.87L8.45 0.53C8.63 0.36 8.84 0.23 9.09 0.14C9.33 0.05 9.6 0 9.87 0C10.17 0 10.47 0.05 10.74 0.16C11.01 0.27 11.25 0.43 11.43 0.63C11.61 0.82 11.73 1.04 11.79 1.27C11.84 1.5 11.83 1.75 11.75 1.97L10.09 7.18L12.84 8.08C13.13 8.17 13.38 8.32 13.58 8.51C13.78 8.71 13.93 8.93 14 9.18C14.07 9.43 14.07 9.68 13.99 9.93C13.91 10.17 13.77 10.4 13.56 10.59L5.59 17.93C5.42 18.1 5.2 18.23 4.96 18.32C4.71 18.42 4.45 18.47 4.18 18.47ZM9.89 1.58L1.92 8.92L6.24 10.33L4.15 16.88L12.13 9.55L7.8 8.13L9.89 1.58Z" fill="#27AE60" fillOpacity="0.6" fillRule="evenodd" />
                        </g>
                    </svg>
                </div>
            )
        },
        {
            path: '/dashboard',
            label: '个人中心',
            icon: (
                <div className={isActive('/dashboard') ? 'filter drop-shadow-[0_0_3px_rgba(39,174,96,0.6)]' : ''}>
                    <svg className="mr-2" width="19.000000" height="17.000000" viewBox="0 0 19 17" fill="none" xmlns="http://www.w3.org/2000/svg" >
                        <desc>
                            Created with Pixso.
                        </desc>
                        <defs />
                        <path id="Fill 1161" d="M9.49 17C8.82 16.93 8.17 16.67 7.64 16.24C6.94 15.74 6.27 15.19 5.65 14.59C4.46 13.47 3.05 11.97 1.45 10.12C0.47 8.95 -0.05 7.46 0 5.92C0.04 4.39 0.65 2.92 1.69 1.82C2.69 0.74 4.05 0.09 5.5 0.01C6.95 -0.08 8.38 0.4 9.49 1.35C10.6 0.4 12.03 -0.08 13.48 0C14.93 0.09 16.3 0.74 17.29 1.81C18.34 2.92 18.95 4.38 18.99 5.92C19.04 7.46 18.52 8.95 17.53 10.12C15.94 11.97 14.52 13.47 13.34 14.59C12.71 15.19 12.05 15.74 11.35 16.24C10.81 16.67 10.17 16.93 9.49 17ZM5.83 1.71C5.27 1.71 4.72 1.83 4.2 2.05C3.69 2.28 3.22 2.61 2.83 3.02C2.08 3.81 1.65 4.86 1.61 5.96C1.57 7.05 1.94 8.13 2.64 8.96C4.21 10.77 5.58 12.23 6.72 13.31C7.28 13.85 7.88 14.35 8.52 14.81C8.8 15.04 9.14 15.2 9.49 15.28C9.85 15.2 10.18 15.04 10.47 14.81C11.1 14.35 11.7 13.85 12.26 13.3C13.41 12.23 14.78 10.77 16.34 8.96C17.04 8.13 17.41 7.05 17.37 5.96C17.34 4.86 16.9 3.81 16.15 3.02C15.43 2.24 14.44 1.77 13.39 1.71C12.34 1.65 11.31 2 10.5 2.69L9.49 3.55L8.48 2.69C7.74 2.06 6.8 1.71 5.83 1.71L5.83 1.71Z" fill="#27AE60" fillOpacity={isActive('/dashboard') ? "1" : "0.6"} fillRule="evenodd" />
                    </svg>
                </div>
            )
        },
        {
            path: '/order',
            label: '订单管理',
            icon: (
                <div className={isActive('/order') ? 'filter drop-shadow-[0_0_3px_rgba(39,174,96,0.6)]' : ''}>
                    <svg className="mr-2" width="17.000000" height="19.000000" viewBox="0 0 17 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <defs />
                        <path id="Fill 929" d="M14.62 19L2.37 19C2.03 18.99 1.7 18.92 1.4 18.79C1.09 18.65 0.82 18.45 0.59 18.2C0.37 17.95 0.21 17.65 0.1 17.33C0 17.01 -0.03 16.68 0.01 16.34L1.22 6.05C1.29 5.47 1.57 4.94 2 4.55C2.44 4.17 3 3.95 3.58 3.95L4.54 3.95C4.54 2.9 4.96 1.9 5.7 1.15C6.44 0.41 7.45 0 8.5 0C9.54 0 10.55 0.41 11.29 1.15C12.03 1.9 12.45 2.9 12.45 3.95L13.41 3.95C14 3.95 14.56 4.17 14.99 4.55C15.42 4.94 15.7 5.47 15.77 6.05L16.98 16.34C17.02 16.68 16.99 17.01 16.89 17.33C16.78 17.65 16.62 17.95 16.39 18.2C16.17 18.45 15.9 18.65 15.59 18.79C15.29 18.92 14.96 19 14.62 19ZM3.58 5.54C3.39 5.54 3.2 5.61 3.05 5.74C2.91 5.87 2.82 6.04 2.79 6.23L1.58 16.53C1.56 16.64 1.57 16.75 1.61 16.86C1.64 16.96 1.7 17.06 1.77 17.15C1.84 17.23 1.93 17.3 2.04 17.34C2.14 17.39 2.25 17.41 2.36 17.41L14.62 17.41C14.73 17.41 14.84 17.39 14.94 17.34C15.05 17.3 15.14 17.23 15.21 17.15C15.29 17.06 15.34 16.96 15.38 16.86C15.41 16.75 15.42 16.64 15.41 16.53L14.2 6.23C14.17 6.04 14.08 5.86 13.94 5.74C13.79 5.61 13.61 5.54 13.41 5.54L12.45 5.54L12.45 6.33C12.45 6.54 12.36 6.74 12.22 6.89C12.07 7.04 11.87 7.12 11.66 7.12C11.45 7.12 11.25 7.04 11.1 6.89C10.95 6.74 10.87 6.54 10.87 6.33L10.87 5.54L6.12 5.54L6.12 6.33C6.12 6.54 6.04 6.74 5.89 6.89C5.74 7.04 5.54 7.12 5.33 7.12C5.12 7.12 4.92 7.04 4.77 6.89C4.63 6.74 4.54 6.54 4.54 6.33L4.54 5.54L3.58 5.54ZM8.49 1.58C7.86 1.58 7.26 1.83 6.82 2.27C6.37 2.72 6.12 3.32 6.12 3.95L10.86 3.95C10.86 3.32 10.61 2.72 10.17 2.27C9.72 1.83 9.12 1.58 8.49 1.58Z" fill="#27AE60" fillOpacity={isActive('/order') ? "1" : "0.6"} fillRule="evenodd" />
                    </svg>
                </div>
            )
        },
        {
            path: '/help',
            label: '帮助文档',
            icon: (
                <div className={isActive('/help') ? 'filter drop-shadow-[0_0_3px_rgba(39,174,96,0.6)]' : ''}>
                    <svg className="mr-2" width="18.000000" height="19.000000" viewBox="0 0 18 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <defs />
                        <g opacity={isActive('/help') ? "1" : "0.6"}>
                            <path id="Fill 997" d="M9 19C8.58 18.99 8.18 18.89 7.81 18.7L0.86 14.97C0.6 14.83 0.38 14.63 0.23 14.38C0.08 14.12 0 13.84 0 13.55C0 13.25 0.08 12.97 0.23 12.72C0.38 12.47 0.6 12.26 0.86 12.12L1.98 11.52L0.86 10.92C0.6 10.78 0.38 10.57 0.23 10.32C0.08 10.07 0 9.78 0 9.49C0 9.2 0.08 8.91 0.23 8.66C0.38 8.41 0.6 8.21 0.86 8.07L1.98 7.47L0.86 6.87C0.6 6.73 0.38 6.52 0.23 6.27C0.08 6.02 0 5.73 0 5.44C0 5.15 0.08 4.86 0.23 4.61C0.38 4.36 0.6 4.15 0.86 4.02L7.81 0.29C8.17 0.1 8.58 0 9 0C9.41 0 9.82 0.1 10.18 0.29L17.13 4.02C17.39 4.16 17.61 4.36 17.76 4.62C17.91 4.87 18 5.15 18 5.44C18 5.74 17.91 6.02 17.76 6.27C17.61 6.52 17.39 6.73 17.13 6.87L16.01 7.47L17.13 8.08C17.39 8.22 17.61 8.42 17.76 8.67C17.91 8.92 18 9.21 18 9.5C18 9.79 17.91 10.08 17.76 10.33C17.61 10.58 17.39 10.79 17.13 10.93L16.01 11.53L17.13 12.13C17.39 12.27 17.61 12.48 17.76 12.73C17.91 12.98 18 13.27 18 13.56C18 13.85 17.91 14.14 17.76 14.39C17.61 14.64 17.39 14.84 17.13 14.98L10.18 18.7C9.82 18.89 9.41 18.99 9 19ZM3.7 12.44L1.65 13.55L8.6 17.28C8.72 17.34 8.86 17.37 8.99 17.37C9.13 17.37 9.27 17.34 9.39 17.28L16.34 13.55L14.28 12.44L10.18 14.65C9.82 14.84 9.41 14.94 8.99 14.94C8.58 14.94 8.17 14.84 7.81 14.65L3.7 12.44ZM3.7 8.39L1.65 9.5L8.6 13.22C8.72 13.29 8.86 13.32 8.99 13.32C9.13 13.32 9.27 13.29 9.39 13.22L16.34 9.5L14.28 8.39L10.18 10.59C9.82 10.79 9.41 10.89 8.99 10.89C8.58 10.89 8.17 10.79 7.81 10.59L3.7 8.39ZM9 1.62C8.86 1.62 8.72 1.65 8.6 1.72L1.65 5.44L8.6 9.17C8.72 9.24 8.86 9.27 8.99 9.27C9.13 9.27 9.27 9.24 9.39 9.17L16.34 5.44L9.39 1.71C9.27 1.65 9.13 1.62 9 1.62L9 1.62Z" fill="#27AE60" fillOpacity="0.6" fillRule="evenodd" />
                        </g>
                    </svg>
                </div>
            )
        }
    ]

    return (
        <nav className="bg-white shadow-lg fixed w-full top-0 z-50">
            <div className="container mx-auto px-6 py-4">
                <div className="flex items-center justify-between">
                    <Link to="/" className="flex-shrink-0">
                        <span className="text-2xl font-bold bg-gradient-to-r from-blue-600 to-indigo-600 bg-clip-text text-transparent">
                            便宜机场
                        </span>
                    </Link>

                    <div className="flex-grow flex justify-center">
                        <div className="hidden md:flex items-center space-x-12">
                            {navLinks.map(({ path, label, icon }) => (
                                <Link
                                    key={path}
                                    to={path}
                                    className={`px-2 py-4 transition-colors flex items-center ${isActive(path)
                                        ? 'text-gray-900 font-semibold'
                                        : 'text-gray-600 hover:text-gray-800'
                                        }`}
                                >
                                    {icon}
                                    {label}
                                </Link>
                            ))}
                        </div>
                    </div>

                    <div className="flex-shrink-0">
                        <button className="relative h-[34px] w-[120px] rounded-[38.65px] 
                            bg-gradient-to-b from-blue-500 to-blue-600 
                            shadow-[0_4px_9px_rgba(0,0,0,0.25),0_0_20px_rgba(96,165,250,0.5)] 
                            before:absolute before:inset-0 
                            before:rounded-[38.65px] 
                            before:shadow-[inset_0_-2px_4px_rgba(0,0,0,0.25),inset_0_4px_4px_rgb(110,142,253)]
                            hover:shadow-[0_8px_20px_rgba(96,165,250,0.5),0_4px_9px_rgba(0,0,0,0.25)]
                            active:shadow-[0_2px_4px_rgba(0,0,0,0.25)]
                            active:translate-y-[1px]
                            focus:outline-none
                            transform
                            transition-all
                            duration-200
                            ease-out
                            text-white 
                            font-medium
                            select-none
                            md:w-[120px] 
                            md:h-[34px]
                            sm:w-[100px] 
                            sm:h-[32px]
                            border-0
                            outline-none
                            ring-0
                            "
                        >
                            <span className="relative z-10 inline-flex items-center justify-center w-full h-full">
                                登录
                            </span>
                        </button>
                    </div>
                </div>
            </div>
        </nav>
    )
}

export default Navbar
